ALMOWAFI/theghostrobot/esp32/src/main.cpp
/**
 * THE GHOST ROBOT — ESP32 Drive System
 * ─────────────────────────────────────
 * Controller : Xbox via Bluetooth (Bluepad32)
 * Hardware   : TB6612FNG (drive motors) + L298N Mini (linear actuator)
 * Battery    : 2x 7.4V LiPo in series = 14.8V
 *
 * Controls:
 *   Left stick Y      — forward / backward
 *   Right stick X     — turn
 *   Y button          — turbo (instant acceleration)
 *   R2 (hold)         — BOOST MODE (full 14.8V)
 *   R1 (hold)         — extend actuator
 *   L1 (hold)         — retract actuator
 *
 * ─── CONFIGURATION ───────────────────────────────────────────────────────────
 * Edit the flags below before uploading.
 * No need to touch anything else.
 */

// Set to 1 to run motor + actuator test on boot
#define TEST_MODE               0

// Set to 1 if left motor spins the wrong direction
#define INVERT_LEFT_MOTOR       0

// Set to 1 if right motor spins the wrong direction
#define INVERT_RIGHT_MOTOR      0

// Set to 1 if actuator extends when it should retract
#define INVERT_ACTUATOR         0

// Set to 1 only if you have built the voltage divider circuit on GPIO 34
// (100kΩ from battery+ to GPIO34, 47kΩ from GPIO34 to GND)
// Leave 0 if unsure — safe default
#define ENABLE_BATTERY_MONITOR  0

// Competition-safe default: keep bonded controller keys.
// Set to 1 only when you explicitly want to erase pairings and pair again.
#define RESET_BT_KEYS_ON_BOOT    1

// Set to 1 to print controller inputs to Serial for verification.
#define INPUT_DEBUG_MODE          1

// ─────────────────────────────────────────────────────────────────────────────

#include <Arduino.h>
#include <Bluepad32.h>

// ─── Motor Driver Pins (TB6612FNG) ───────────────────────────────────────────
#define ENA_PIN     14    // PWMA — Left motor PWM   — LEDC channel 0
#define IN1_PIN     27    // AIN1 — Left motor forward
#define IN2_PIN     26    // AIN2 — Left motor backward
#define IN3_PIN     25    // BIN1 — Right motor forward
#define IN4_PIN     33    // BIN2 — Right motor backward
#define ENB_PIN     32    // PWMB — Right motor PWM  — LEDC channel 1
#define STBY_PIN    13    // STBY — must be HIGH to enable motors (avoid GPIO12 strapping pin)

// ─── Actuator Pins (L298N Mini — Channel B) ──────────────────────────────────
#define ACT_IN1     16    // IN3 — Actuator extend
#define ACT_IN2     17    // IN4 — Actuator retract

// ─── Xbox Button Masks ───────────────────────────────────────────────────────
#define BTN_Y       0x0008
#define BTN_L1      0x0010
#define BTN_R1      0x0020

// ─── Battery Monitor (only used if ENABLE_BATTERY_MONITOR = 1) ───────────────
#define BATT_PIN        34
#define BATT_FULL_V     14.8f
#define BATT_EMPTY_V    12.0f
#define BATT_DIVIDER    (147.0f / 47.0f)  // (R1+R2)/R2 with 100k/47k divider

// ─── LEDC PWM ────────────────────────────────────────────────────────────────
#define PWM_FREQ        20000   // 20kHz — optimal for TB6612FNG + 25GA-370
#define PWM_RES         8       // 8-bit (0–255)
#define LEDC_CH_L       0
#define LEDC_CH_R       1

// ─── Drive Config ────────────────────────────────────────────────────────────
// Physics: μ(SBR)=0.65, m=0.838kg → max_accel=6.37m/s²
// Ramp: 20 steps × 2ms = 40ms to full speed — just at slip threshold
#define RAMP_STEPS      20
#define RAMP_MS         2
#define MAX_PWM         255                      // absolute ceiling (14.8V)
#define NORMAL_MAX_PWM  206                      // 12V equivalent: (12/14.8)*255=206
#define BOOST_THRESHOLD 300                      // R2 analog threshold (0-1023) — ~30% press
#define STICK_MAX       512
#define DEADZONE        30

// ─── LEDC Compatibility (ESP32 Arduino Core v2.x vs v3.x) ───────────────────
void setupLEDC(uint8_t channel, uint32_t freq, uint8_t res, uint8_t pin) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    ledcAttachChannel(pin, freq, res, channel);
#else
    ledcSetup(channel, freq, res);
    ledcAttachPin(pin, channel);
#endif
}

// ─── Gamepad ─────────────────────────────────────────────────────────────────
GamepadPtr gp = nullptr;

void onConnected(GamepadPtr gamepad) {
    gp = gamepad;
    Serial.println("[BT] Xbox connected");
}
void onDisconnected(GamepadPtr gamepad) {
    gp = nullptr;
    Serial.println("[BT] Xbox disconnected");
}

// ─── Motor State ─────────────────────────────────────────────────────────────
volatile int leftCurrent  = 0;
volatile int rightCurrent = 0;
#if INPUT_DEBUG_MODE
static uint32_t lastInputLogMs = 0;
static uint16_t lastButtons = 0;
#endif

// ─── Motor Output ────────────────────────────────────────────────────────────
void IRAM_ATTR driveMotor(int ch, int pinA, int pinB, int pwm, bool invert) {
    if (invert) pwm = -pwm;
    if (pwm > 0) {
        digitalWrite(pinA, HIGH);
        digitalWrite(pinB, LOW);
    } else if (pwm < 0) {
        digitalWrite(pinA, LOW);
        digitalWrite(pinB, HIGH);
        pwm = -pwm;
    } else {
        digitalWrite(pinA, LOW);
        digitalWrite(pinB, LOW);
    }
    ledcWrite(ch, constrain(pwm, 0, MAX_PWM));
}

// ─── Actuator Output ─────────────────────────────────────────────────────────
void driveActuator(bool extend, bool retract) {
#if INVERT_ACTUATOR
    bool tmp = extend; extend = retract; retract = tmp;
#endif
    if (extend) {
        digitalWrite(ACT_IN1, HIGH);
        digitalWrite(ACT_IN2, LOW);
    } else if (retract) {
        digitalWrite(ACT_IN1, LOW);
        digitalWrite(ACT_IN2, HIGH);
    } else {
        digitalWrite(ACT_IN1, LOW);
        digitalWrite(ACT_IN2, LOW);
    }
}

// ─── Battery Compensation ────────────────────────────────────────────────────
float voltageCompensation() {
#if ENABLE_BATTERY_MONITOR
    int raw = analogRead(BATT_PIN);
    float v = (raw / 4095.0f) * 3.3f * BATT_DIVIDER;
    v = constrain(v, BATT_EMPTY_V, BATT_FULL_V);
    return BATT_FULL_V / v;
#else
    return 1.0f;
#endif
}

// ─── Test Mode ───────────────────────────────────────────────────────────────
#if TEST_MODE
void runTestMode() {
    Serial.println("[TEST] Left motor FORWARD 1s");
    driveMotor(LEDC_CH_L, IN1_PIN, IN2_PIN, 180, INVERT_LEFT_MOTOR);
    delay(1000);
    driveMotor(LEDC_CH_L, IN1_PIN, IN2_PIN, 0, false);
    delay(500);

    Serial.println("[TEST] Left motor BACKWARD 1s");
    driveMotor(LEDC_CH_L, IN1_PIN, IN2_PIN, -180, INVERT_LEFT_MOTOR);
    delay(1000);
    driveMotor(LEDC_CH_L, IN1_PIN, IN2_PIN, 0, false);
    delay(500);

    Serial.println("[TEST] Right motor FORWARD 1s");
    driveMotor(LEDC_CH_R, IN3_PIN, IN4_PIN, 180, INVERT_RIGHT_MOTOR);
    delay(1000);
    driveMotor(LEDC_CH_R, IN3_PIN, IN4_PIN, 0, false);
    delay(500);

    Serial.println("[TEST] Right motor BACKWARD 1s");
    driveMotor(LEDC_CH_R, IN3_PIN, IN4_PIN, -180, INVERT_RIGHT_MOTOR);
    delay(1000);
    driveMotor(LEDC_CH_R, IN3_PIN, IN4_PIN, 0, false);
    delay(500);

    Serial.println("[TEST] Actuator EXTEND 1s");
    driveActuator(true, false);
    delay(1000);
    driveActuator(false, false);
    delay(500);

    Serial.println("[TEST] Actuator RETRACT 1s");
    driveActuator(false, true);
    delay(1000);
    driveActuator(false, false);

    Serial.println("[TEST] Done. If any motor/actuator wrong direction,");
    Serial.println("[TEST] set INVERT_LEFT_MOTOR / INVERT_RIGHT_MOTOR / INVERT_ACTUATOR to 1.");
}
#endif

// ─── Core 0: Bluetooth Task ──────────────────────────────────────────────────
void bluetoothTask(void* param) {
    for (;;) {
        BP32.update();
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

// ─── Core 1: Motor + Actuator Control Task ───────────────────────────────────
void motorTask(void* param) {
    TickType_t lastWake = xTaskGetTickCount();

    for (;;) {
        int leftTarget = 0, rightTarget = 0;

        if (gp && gp->isConnected()) {
            int ly     = -gp->axisY();
            int rx     =  gp->axisRX();
            uint16_t b =  gp->buttons();
            bool turbo  = (b & BTN_Y)  != 0;
            bool r1     = (b & BTN_R1) != 0;
            bool l1     = (b & BTN_L1) != 0;
            bool boost  = (gp->throttle() > BOOST_THRESHOLD);  // R2 hold = full 14.8V

            // Default = 12V safe. Hold R2 = full 14.8V monster mode.
            int pwm_cap = boost ? MAX_PWM : NORMAL_MAX_PWM;

            if (abs(ly) < DEADZONE) ly = 0;
            if (abs(rx) < DEADZONE) rx = 0;

            // Tank drive mixing
            int left  = constrain(ly + rx, -STICK_MAX, STICK_MAX);
            int right = constrain(ly - rx, -STICK_MAX, STICK_MAX);

            leftTarget  = map(abs(left),  0, STICK_MAX, 0, pwm_cap) * (left  < 0 ? -1 : 1);
            rightTarget = map(abs(right), 0, STICK_MAX, 0, pwm_cap) * (right < 0 ? -1 : 1);

            if (turbo || boost) {
                // Bypass ramp — instant full power
                leftCurrent  = leftTarget;
                rightCurrent = rightTarget;
            } else {
                int lStep = (leftTarget  - leftCurrent)  / RAMP_STEPS;
                int rStep = (rightTarget - rightCurrent) / RAMP_STEPS;
                if (lStep == 0 && leftTarget  != leftCurrent)  lStep = (leftTarget  > leftCurrent)  ? 1 : -1;
                if (rStep == 0 && rightTarget != rightCurrent) rStep = (rightTarget > rightCurrent) ? 1 : -1;
                leftCurrent  += lStep;
                rightCurrent += rStep;
            }

            // Actuator — R1 = extend, L1 = retract, neither = stop
            driveActuator(r1, l1);
#if INPUT_DEBUG_MODE
            // Log immediate button edge changes.
            uint16_t changed = (uint16_t)(b ^ lastButtons);
            if (changed & BTN_Y) {
                Serial.println((b & BTN_Y) ? "[IN] Y pressed (turbo ON)" : "[IN] Y released (turbo OFF)");
            }
            static bool lastBoost = false;
            if (boost != lastBoost) {
                Serial.println(boost ? "[IN] R2 held — BOOST (14.8V)" : "[IN] R2 released — normal (12V cap)");
                lastBoost = boost;
            }
            if (changed & BTN_R1) {
                Serial.println((b & BTN_R1) ? "[IN] R1 pressed (actuator EXTEND)" : "[IN] R1 released");
            }
            if (changed & BTN_L1) {
                Serial.println((b & BTN_L1) ? "[IN] L1 pressed (actuator RETRACT)" : "[IN] L1 released");
            }
            lastButtons = b;

            // Print stick snapshot at a low rate to keep logs readable.
            uint32_t now = millis();
            if (now - lastInputLogMs >= 250) {
                lastInputLogMs = now;
                int dbgLeftOut  = constrain((int)(leftCurrent  * voltageCompensation()), -MAX_PWM, MAX_PWM);
                int dbgRightOut = constrain((int)(rightCurrent * voltageCompensation()), -MAX_PWM, MAX_PWM);
                Serial.printf("[IN] LY=%d RX=%d | Lout=%d Rout=%d\n", ly, rx, dbgLeftOut, dbgRightOut);
            }
#endif

        } else {
            // No controller — stop everything
            leftCurrent  = leftCurrent  * 3 / 4;
            rightCurrent = rightCurrent * 3 / 4;
            driveActuator(false, false);
#if INPUT_DEBUG_MODE
            lastButtons = 0;
#endif
        }

        float comp   = voltageCompensation();
        int leftOut  = constrain((int)(leftCurrent  * comp), -MAX_PWM, MAX_PWM);
        int rightOut = constrain((int)(rightCurrent * comp), -MAX_PWM, MAX_PWM);

        driveMotor(LEDC_CH_L, IN1_PIN, IN2_PIN, leftOut,  INVERT_LEFT_MOTOR);
        driveMotor(LEDC_CH_R, IN3_PIN, IN4_PIN, rightOut, INVERT_RIGHT_MOTOR);

        vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(RAMP_MS));
    }
}

// ─── Setup ───────────────────────────────────────────────────────────────────
void setup() {
    Serial.begin(115200);
    Serial.println("[GHOST] Drive system starting...");

    pinMode(IN1_PIN, OUTPUT); pinMode(IN2_PIN, OUTPUT);
    pinMode(IN3_PIN, OUTPUT); pinMode(IN4_PIN, OUTPUT);
    pinMode(STBY_PIN, OUTPUT); digitalWrite(STBY_PIN, HIGH);

    pinMode(ACT_IN1, OUTPUT); pinMode(ACT_IN2, OUTPUT);
    driveActuator(false, false);

    setupLEDC(LEDC_CH_L, PWM_FREQ, PWM_RES, ENA_PIN);
    setupLEDC(LEDC_CH_R, PWM_FREQ, PWM_RES, ENB_PIN);

    driveMotor(LEDC_CH_L, IN1_PIN, IN2_PIN, 0, false);
    driveMotor(LEDC_CH_R, IN3_PIN, IN4_PIN, 0, false);

#if TEST_MODE
    runTestMode();
    Serial.println("[TEST] Entering normal drive mode...");
#endif

    BP32.setup(&onConnected, &onDisconnected);
#if RESET_BT_KEYS_ON_BOOT
    Serial.println("[BT] Clearing stored Bluetooth keys (re-pair required)...");
    BP32.forgetBluetoothKeys();
#endif

    xTaskCreatePinnedToCore(bluetoothTask, "BT",    4096, NULL, 1, NULL, 0);
    xTaskCreatePinnedToCore(motorTask,     "Motor", 4096, NULL, 2, NULL, 1);

    Serial.println("[GHOST] Ready. Pair Xbox controller now.");
}

void loop() {
    vTaskDelete(NULL);
}
